tutorials/swak4Foam/groovyBC/average-t-junction/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       21200;
    }
    outlet1
    {
        type            patch;
        nFaces          75;
        startFace       21225;
    }
    outlet2
    {
        type            patch;
        nFaces          50;
        startFace       21300;
    }
    defaultFaces
    {
        type            wall;
        nFaces          4700;
        startFace       21350;
    }
)

// ************************************************************************* //
