tutorials/swak4Foam/groovyBC/average-t-junction/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet      
    {
        //type            totalPressure;
        //p0              uniform 100040;

        type            timeVaryingTotalPressure;
        p0              100040; // only used for restarts
        outOfBounds     clamp;
        fileName        "$FOAM_CASE/constant/p0vsTime";

        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 100040;
    }

    outlet1     
    {
        type            groovyBC;
        valueExpression "0.5*(pInlet+pOutlet2)";
        variables       "pInlet{inlet}=sum(p*mag(Sf()))/sum(mag(Sf()));pOutlet2{outlet2}=p;";
        value           uniform 100010;
    }

    outlet2    
    {
        type            fixedValue;
        value           uniform 100000;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
